RIET/src/Catalogs/КостЦентры/КостЦентры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КостЦентры</name>
  <comment>Параллельный с подразделениями учет ОС </comment>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubSegment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сегмент</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultActivity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OnlyMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>NonLawson</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Geomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
  <attributes>
    <name>SubGeomarket</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/InformationRegisters/AUsAndLegalEntities/AUsAndLegalEntities.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AUsAndLegalEntities</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </resources>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ParentCompany</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Catalogs/КостЦентры/Forms/ФормаСпискаПолного/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отбор = Параметры.Отбор;
	
	Отбор.Вставить("ПометкаУдаления", Ложь);                                                                                                		
	
	//[РКХ->]
	//УстановкиДинамическогоСписка(); 
	
	//Если ОбщегоНазначенияПовтИсп.ИдентификаторРабочейКонфигурации() <> "PA" Тогда
	ParentCompanyPA = Справочники.SoldTo.НайтиПоКоду("PA");
	Если ЗначениеЗаполнено(ParentCompanyPA) Тогда  
		Список.Параметры.УстановитьЗначениеПараметра("ParentCompanyPA", Справочники.SoldTo.НайтиПоКоду("PA"));
	КонецЕсли;
	//КонецЕсли;
	//[<-РКХ]

КонецПроцедуры

//[РКХ->]
Процедура УстановкиДинамическогоСписка()
	
	Список.ПроизвольныйЗапрос = Истина;
	
	Если ОбщегоНазначенияПовтИсп.ИдентификаторРабочейКонфигурации() = "PA" Тогда
		
		Список.ТекстЗапроса = "ВЫБРАТЬ
		                      |	СправочникКостЦентры.Ссылка,
		                      |	СправочникКостЦентры.ВерсияДанных,
		                      |	СправочникКостЦентры.ПометкаУдаления,
		                      |	СправочникКостЦентры.Предопределенный,
		                      |	СправочникКостЦентры.Код,
		                      |	СправочникКостЦентры.Наименование,
		                      |	СправочникКостЦентры.Segment,
		                      |	СправочникКостЦентры.SubSegment,
		                      |	СправочникКостЦентры.Сегмент,
		                      |	СправочникКостЦентры.DefaultActivity,
		                      |	СправочникКостЦентры.OnlyMS,
		                      |	СправочникКостЦентры.TaxRegistration,
		                      |	СправочникКостЦентры.ПодразделениеОрганизации
		                      |ИЗ
		                      |	Справочник.КостЦентры КАК СправочникКостЦентры";	
							  
		Элементы.SLILegalEntity.Видимость 	= Ложь;							  
		Элементы.PALegalEntity.Видимость 	= Ложь;
		
	Иначе

		Список.ТекстЗапроса = "ВЫБРАТЬ
		                      |	СправочникКостЦентры.Ссылка,
		                      |	СправочникКостЦентры.Код,
		                      |	СправочникКостЦентры.Наименование,
		                      |	СправочникКостЦентры.Segment,
		                      |	СправочникКостЦентры.SubSegment,
		                      |	СправочникКостЦентры.Сегмент,
		                      |	СправочникКостЦентры.DefaultActivity,
		                      |	СправочникКостЦентры.OnlyMS,
		                      |	СправочникКостЦентры.TaxRegistration,
		                      |	СправочникКостЦентры.ПодразделениеОрганизации,
		                      |	СправочникКостЦентры.TaxRegistration.LegalEntity КАК SLILegalEntity,
		                      |	МАКСИМУМ(AUsAndLegalEntities.LegalEntity) КАК PALegalEntity
		                      |ИЗ
		                      |	Справочник.КостЦентры КАК СправочникКостЦентры
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AUsAndLegalEntities КАК AUsAndLegalEntities
		                      |		ПО СправочникКостЦентры.Ссылка = AUsAndLegalEntities.AU
		                      |			И (AUsAndLegalEntities.ParentCompany = &ParentCompanyPA)
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	СправочникКостЦентры.Код,
		                      |	СправочникКостЦентры.Наименование,
		                      |	СправочникКостЦентры.Segment,
		                      |	СправочникКостЦентры.SubSegment,
		                      |	СправочникКостЦентры.Сегмент,
		                      |	СправочникКостЦентры.DefaultActivity,
		                      |	СправочникКостЦентры.OnlyMS,
		                      |	СправочникКостЦентры.TaxRegistration,
		                      |	СправочникКостЦентры.ПодразделениеОрганизации,
		                      |	СправочникКостЦентры.TaxRegistration.LegalEntity,
		                      |	СправочникКостЦентры.Ссылка";
			
			// да, можно было бы и в форме истину поставить и тут не ставить, но почему-то НЕ РАБОТАЕТ в таком случае :(				  
			Элементы.SLILegalEntity.Видимость 	= Истина;							  
			Элементы.PALegalEntity.Видимость 	= Истина;
							  
	КонецЕсли;
	
	
	
КонецПроцедуры
//[<-РКХ]
